### Grouping, Pivoting, and Reshaping

Working of conditional subset of huge dataset is one of the most powerful aspect of pandas. Much of this functionality is similar to MS Excel's pivot tables, but even more powerful.

In [1]:
import pandas as pd


scores = pd.DataFrame({
    'name': ['Adam', 'Bob', 'Dave', 'Fred'],
    'age': [15, 16, 16, 15],
    'test1': [96, 61, 89, None],
    'test2': [80, 82, 84, 88],
    'teacher': ['Ashby', 'Ashby', 'Jones', 'Jones']
})

scores

   name  age  test1  test2 teacher
0  Adam   15   96.0     80   Ashby
1   Bob   16   61.0     82   Ashby
2  Dave   16   89.0     84   Jones
3  Fred   15    NaN     88   Jones

### Reducing Datasets

By using the `.groupby()` method, we can group DataFrames by column values, then merge them back into a result. Here, let's compute the median scores for each teacher:

In [2]:
scores.groupby('teacher').median()

          age  test1  test2
teacher
Ashby    15.5   78.5   81.0
Jones    15.5   89.0   86.0

The age column is irrelavant here (we don't actually care about the median age of each teachers' students), so we can slice them out:

In [3]:
scores.groupby('teacher').median().loc[:, ['test1', 'test2']]

         test1  test2
teacher
Ashby     78.5   81.0
Jones     89.0   86.0

The `.groupby()` method actually returns a `GroupBy` object, which we must call some method on it (in this case, `.median()`). We can use multiple columns to `.groupby()` as well. Here, we can find the median valuies for every age group for each teacher:

In [4]:
scores.groupby(['teacher', 'age']).median()

             test1  test2
teacher age
Ashby   15    96.0     80
        16    61.0     82
Jones   15     NaN     88
        16    89.0     84

Sometimes, we want to run multiple function over each cells (or the cells resulting from a `.groupby()`), in this case, instead of `.apply()` or `.map()`, we can use `.agg()`:

In [5]:
scores.groupby(['teacher', 'age']).agg([min, max])

             name       test1       test2
              min   max   min   max   min max
teacher age
Ashby   15   Adam  Adam  96.0  96.0    80  80
        16    Bob   Bob  61.0  61.0    82  82
Jones   15   Fred  Fred   NaN   NaN    88  88
        16   Dave  Dave  89.0  89.0    84  84

Here a list of other methods that can be called to a `GroupBy` object:

* `.all()`: Boolean if all cells in group are `True`
* `.any()`: Boolean if any cells in group are `True`
* `.count()`: Count of non-null values
* `.size()`: Size of group (includes null values)
* `.idxmax()`: Index of maximum values
* `.idxmin()`: Index of minimum values
* `.quantile()`: Quantile (default of 50%) of group
* `.agg(FUNC)`: Apply func (a function or list of function) to each group's column
* `.apply(FUNC)`: Similar to `.agg()`, but apply func with a split-apply-combine manner
* `.last()`: Last value
* `.nth()`: Nth row from each group
* `.max()`: Maximum value
* `.min()`: Minimum value
* `.mean()`: Mean value
* `.median()`: Median value
* `.sem()`: Standard error of mean of group
* `.std()`: Standard deviation 
* `.var()`: Variance of group
* `.prod()`: Product of group
* `.sum()`: Sum of group

### Pivot Tables

We can use pivot tables in pandas to generalize `.groupby()` behaviors. For example:

In [7]:
scores.pivot_table(index='teacher',
                  values=['test1', 'test2'],
                  aggfunc='median')

         test1  test2
teacher
Ashby     78.5     81
Jones     89.0     86

Similarly, if we want to aggregate by teacher and age, we can call a list of index instead:

In [8]:
scores.pivot_table(index=['teacher', 'age'],
                  values=['test1', 'test2'],
                  aggfunc='median')

             test1  test2
teacher age
Ashby   15    96.0     80
        16    61.0     82
Jones   15     NaN     88
        16    89.0     84

We also have the option of using a list of functions as well:

In [9]:
scores.pivot_table(index='teacher',
                  values=['test1', 'test2'],
                  aggfunc=[min, max])

          min         max
        test1 test2 test1 test2
teacher
Ashby    61.0    80  96.0    82
Jones    89.0    84  89.0    88

Pivot tables and `.groupby()` are ultimately very similar, but cater to different analytical style. With pivot tables we can also add a summary row:

In [11]:
scores.pivot_table(index='teacher',
                  values=['test1', 'test2'],
                  aggfunc='median',
                  margins=True)

         test1  test2
teacher
Ashby     78.5     81
Jones     89.0     86
All       89.0     82

### Melting data

Pandas gives us the ability to "melt" data easily into what's known as the "long" format (instead of the "wide" format) of data presentation. In the long format, there is only 1 measurement per row, other columns are not measurement but known charactersitics of the entry. We can do this to our `scores` DataFrame:

In [13]:
pd.melt(scores, id_vars=['name', 'age'], value_vars=['test1', 'test2'])

   name  age variable  value
0  Adam   15    test1   96.0
1   Bob   16    test1   61.0
2  Dave   16    test1   89.0
3  Fred   15    test1    NaN
4  Adam   15    test2   80.0
5   Bob   16    test2   82.0
6  Dave   16    test2   84.0
7  Fred   15    test2   88.0

Compare this to the wide format:

In [14]:
scores

   name  age  test1  test2 teacher
0  Adam   15   96.0     80   Ashby
1   Bob   16   61.0     82   Ashby
2  Dave   16   89.0     84   Jones
3  Fred   15    NaN     88   Jones

What we did here in the melted tall format is to treat each test score as its own datapoint (we ignored the teacher for now.) We can change the description of the datapoint from "variable" to a more descriptive name, we can do that as well:

In [15]:
pd.melt(scores, id_vars=['name', 'age'],
       value_vars=['test1', 'test2'], var_name='test', value_name='score')

   name  age   test  score
0  Adam   15  test1   96.0
1   Bob   16  test1   61.0
2  Dave   16  test1   89.0
3  Fred   15  test1    NaN
4  Adam   15  test2   80.0
5   Bob   16  test2   82.0
6  Dave   16  test2   84.0
7  Fred   15  test2   88.0

### Converting back to wide format

We can do this via a pivot table:

In [17]:
long_df = pd.melt(scores, id_vars=['name', 'age'],
                 value_vars=['test1', 'test2'],
                 var_name='test', value_name='score')

wide_df = long_df.pivot_table(index=['name', 'age'],
                             columns=['test'],
                             values=['score'])

wide_df

         score
test     test1 test2
name age
Adam 15   96.0  80.0
Bob  16   61.0  82.0
Dave 16   89.0  84.0
Fred 15    NaN  88.0

By default, the produced pivot table will have hierarchical multi-indices. If we don't like working for this, we can flatten them via `.reset_index()`:

In [18]:
wide_df = wide_df.reset_index()

wide_df

      name age score
test           test1 test2
0     Adam  15  96.0  80.0
1      Bob  16  61.0  82.0
2     Dave  16  89.0  84.0
3     Fred  15   NaN  88.0

To flatten nested column labels, we can use `.get_level_values()` first, then reassign column labels via list comprehension:

In [19]:
cols = wide_df.columns
cols.get_level_values(0) # Level 0 column labels

Index(['name', 'age', 'score', 'score'], dtype='object')

In [21]:
cols.get_level_values(1) # Level 1 column labels

Index(['', '', 'test1', 'test2'], dtype='object', name='test')

In [22]:
l1 = cols.get_level_values(1)
l0 = cols.get_level_values(0)
names = [x[1] if x[1] else x[0] for x in zip(l0, l1)]
names

['name', 'age', 'test1', 'test2']

In [23]:
wide_df.columns = names
wide_df

   name  age  test1  test2
0  Adam   15   96.0   80.0
1   Bob   16   61.0   82.0
2  Dave   16   89.0   84.0
3  Fred   15    NaN   88.0

### Creating Dummy Variable

Dummy or indicator variables have values of 1 or 0, and indicate whether the presence or absence of a categorical feature is found. In our case, we have an age column, and we can have a column for every age (15 or 16) instead, with a 1 or 2 to indicate whether the row has that age. This is useful as many manchine learning models require inputs formatted this way. Pandas simplify this with the `get_dummies()` function:

In [24]:
pd.get_dummies(scores, columns=['age'], prefix='age')

   name  test1  test2 teacher  age_15  age_16
0  Adam   96.0     80   Ashby       1       0
1   Bob   61.0     82   Ashby       0       1
2  Dave   89.0     84   Jones       0       1
3  Fred    NaN     88   Jones       1       0

Undoing dummifying variables is not trivial in pandas, unfortunately. Here is one way to do so:

In [26]:
def undummy(df, prefix, new_col_name, val_type=float):
    '''df - DataFrame with dummy columns
       prefix - prefix of dummy columns
       new_col_name - column name to replace dummy columns
       val_type - callable type for new column'''
    dummy_cols = [col for col in df.columns if col.startswith(prefix)]
    
    # Map of index location of dummy variable to new value
    idx2val = {i: val_type(col[len(prefix):]) for i, col in enumerate(dummy_cols)}
    
    def get_index(vals):
        # idx of dummy col to use
        return list(vals).index(1)
    
    # Using the dummy_cols lookup the new value by idx
    ser = df.loc[:, dummy_cols].apply(lambda x: idx2val.get(get_index(x), None), axis=1)
    df.loc[:, new_col_name] = ser
    df = df.drop(dummy_cols, axis=1)
    return df

dum = pd.get_dummies(scores, columns=['age'], prefix='age')
undummy(dum, 'age_', 'age')

   name  test1  test2 teacher   age
0  Adam   96.0     80   Ashby  15.0
1   Bob   61.0     82   Ashby  16.0
2  Dave   89.0     84   Jones  16.0
3  Fred    NaN     88   Jones  15.0

### Stacking and Unstacking

To unstack a dataset means to pull out the inner most level of the dataset with a multi-index, and placing it in the columns. Stacking does the opposite. Either of this can be done easily with `.groupby()` or pivot tables.